# handling missing values

In [41]:
import pandas as pd
a=pd.read_csv("sample1.csv")
print(a)

   S NO      NAME  AGE  SALARY GENDER   DEPT Unnamed: 6  Unnamed: 7
0     1    Geetha   19   10000      f    cse        anu         NaN
1     2  laxmisri   20   20000      f    cse        NaN         NaN
2     3       sai   20   25000      m   mech        NaN         NaN
3     4   sumathi   18   30000      f  civil        NaN         NaN
4     5     satya   21   35000      f  civil        NaN         NaN
5     6    kalyan   22   40000      m    ece        NaN         NaN
6     7     madhu   19   25000      f  civil        NaN         NaN

In [42]:
a.isnull()

    S NO   NAME    AGE  SALARY  GENDER   DEPT  Unnamed: 6  Unnamed: 7
0  False  False  False   False   False  False       False        True
1  False  False  False   False   False  False        True        True
2  False  False  False   False   False  False        True        True
3  False  False  False   False   False  False        True        True
4  False  False  False   False   False  False        True        True
5  False  False  False   False   False  False        True        True
6  False  False  False   False   False  False        True        True

In [43]:
a.isnull().sum()

S NO          0
NAME          0
AGE           0
SALARY        0
GENDER        0
DEPT          0
Unnamed: 6    6
Unnamed: 7    7
dtype: int64

In [44]:
a.isnull().sum().sum()

13

In [45]:
df=a.fillna(value=0)
df

   S NO      NAME  AGE  SALARY GENDER   DEPT Unnamed: 6  Unnamed: 7
0     1    Geetha   19   10000      f    cse        anu         0.0
1     2  laxmisri   20   20000      f    cse          0         0.0
2     3       sai   20   25000      m   mech          0         0.0
3     4   sumathi   18   30000      f  civil          0         0.0
4     5     satya   21   35000      f  civil          0         0.0
5     6    kalyan   22   40000      m    ece          0         0.0
6     7     madhu   19   25000      f  civil          0         0.0

In [46]:
print(a.fillna(value="geetha"))

   S NO      NAME  AGE  SALARY GENDER   DEPT Unnamed: 6 Unnamed: 7
0     1    Geetha   19   10000      f    cse        anu     geetha
1     2  laxmisri   20   20000      f    cse     geetha     geetha
2     3       sai   20   25000      m   mech     geetha     geetha
3     4   sumathi   18   30000      f  civil     geetha     geetha
4     5     satya   21   35000      f  civil     geetha     geetha
5     6    kalyan   22   40000      m    ece     geetha     geetha
6     7     madhu   19   25000      f  civil     geetha     geetha

In [47]:
print(a.fillna(value="anu"))

   S NO      NAME  AGE  SALARY GENDER   DEPT Unnamed: 6 Unnamed: 7
0     1    Geetha   19   10000      f    cse        anu        anu
1     2  laxmisri   20   20000      f    cse        anu        anu
2     3       sai   20   25000      m   mech        anu        anu
3     4   sumathi   18   30000      f  civil        anu        anu
4     5     satya   21   35000      f  civil        anu        anu
5     6    kalyan   22   40000      m    ece        anu        anu
6     7     madhu   19   25000      f  civil        anu        anu

In [48]:
print(a.fillna(method="pad"))

   S NO      NAME  AGE  SALARY GENDER   DEPT Unnamed: 6  Unnamed: 7
0     1    Geetha   19   10000      f    cse        anu         NaN
1     2  laxmisri   20   20000      f    cse        anu         NaN
2     3       sai   20   25000      m   mech        anu         NaN
3     4   sumathi   18   30000      f  civil        anu         NaN
4     5     satya   21   35000      f  civil        anu         NaN
5     6    kalyan   22   40000      m    ece        anu         NaN
6     7     madhu   19   25000      f  civil        anu         NaN

In [49]:
print(a.fillna(method="bfill"))

   S NO      NAME  AGE  SALARY GENDER   DEPT Unnamed: 6  Unnamed: 7
0     1    Geetha   19   10000      f    cse        anu         NaN
1     2  laxmisri   20   20000      f    cse        NaN         NaN
2     3       sai   20   25000      m   mech        NaN         NaN
3     4   sumathi   18   30000      f  civil        NaN         NaN
4     5     satya   21   35000      f  civil        NaN         NaN
5     6    kalyan   22   40000      m    ece        NaN         NaN
6     7     madhu   19   25000      f  civil        NaN         NaN

In [50]:
print(a.fillna(method="pad",axis=1))

  S NO      NAME AGE SALARY GENDER   DEPT Unnamed: 6 Unnamed: 7
0    1    Geetha  19  10000      f    cse        anu        anu
1    2  laxmisri  20  20000      f    cse        cse        cse
2    3       sai  20  25000      m   mech       mech       mech
3    4   sumathi  18  30000      f  civil      civil      civil
4    5     satya  21  35000      f  civil      civil      civil
5    6    kalyan  22  40000      m    ece        ece        ece
6    7     madhu  19  25000      f  civil      civil      civil

In [51]:
print(a.fillna(method="bfill",axis=1))

  S NO      NAME AGE SALARY GENDER   DEPT Unnamed: 6 Unnamed: 7
0    1    Geetha  19  10000      f    cse        anu        NaN
1    2  laxmisri  20  20000      f    cse        NaN        NaN
2    3       sai  20  25000      m   mech        NaN        NaN
3    4   sumathi  18  30000      f  civil        NaN        NaN
4    5     satya  21  35000      f  civil        NaN        NaN
5    6    kalyan  22  40000      m    ece        NaN        NaN
6    7     madhu  19  25000      f  civil        NaN        NaN

In [52]:
print(a.fillna(value=a["AGE"].mean()))

   S NO      NAME  AGE  SALARY GENDER   DEPT Unnamed: 6  Unnamed: 7
0     1    Geetha   19   10000      f    cse        anu   19.857143
1     2  laxmisri   20   20000      f    cse    19.8571   19.857143
2     3       sai   20   25000      m   mech    19.8571   19.857143
3     4   sumathi   18   30000      f  civil    19.8571   19.857143
4     5     satya   21   35000      f  civil    19.8571   19.857143
5     6    kalyan   22   40000      m    ece    19.8571   19.857143
6     7     madhu   19   25000      f  civil    19.8571   19.857143

In [53]:
print(a.fillna(value=a["AGE"].max()))

   S NO      NAME  AGE  SALARY GENDER   DEPT Unnamed: 6  Unnamed: 7
0     1    Geetha   19   10000      f    cse        anu        22.0
1     2  laxmisri   20   20000      f    cse         22        22.0
2     3       sai   20   25000      m   mech         22        22.0
3     4   sumathi   18   30000      f  civil         22        22.0
4     5     satya   21   35000      f  civil         22        22.0
5     6    kalyan   22   40000      m    ece         22        22.0
6     7     madhu   19   25000      f  civil         22        22.0

In [54]:
print(a.fillna(value=a["AGE"].min()))

   S NO      NAME  AGE  SALARY GENDER   DEPT Unnamed: 6  Unnamed: 7
0     1    Geetha   19   10000      f    cse        anu        18.0
1     2  laxmisri   20   20000      f    cse         18        18.0
2     3       sai   20   25000      m   mech         18        18.0
3     4   sumathi   18   30000      f  civil         18        18.0
4     5     satya   21   35000      f  civil         18        18.0
5     6    kalyan   22   40000      m    ece         18        18.0
6     7     madhu   19   25000      f  civil         18        18.0

In [55]:
print(a.dropna())

Empty DataFrame
Columns: [S NO, NAME, AGE, SALARY, GENDER, DEPT, Unnamed: 6, Unnamed: 7]
Index: []

In [56]:
print(a.dropna(how="all"))

   S NO      NAME  AGE  SALARY GENDER   DEPT Unnamed: 6  Unnamed: 7
0     1    Geetha   19   10000      f    cse        anu         NaN
1     2  laxmisri   20   20000      f    cse        NaN         NaN
2     3       sai   20   25000      m   mech        NaN         NaN
3     4   sumathi   18   30000      f  civil        NaN         NaN
4     5     satya   21   35000      f  civil        NaN         NaN
5     6    kalyan   22   40000      m    ece        NaN         NaN
6     7     madhu   19   25000      f  civil        NaN         NaN

In [57]:
print(a.dropna(how="any"))

Empty DataFrame
Columns: [S NO, NAME, AGE, SALARY, GENDER, DEPT, Unnamed: 6, Unnamed: 7]
Index: []

In [60]:
import numpy as np
print(a.replace(to_replace=np.nan,value=2002))

   S NO      NAME  AGE  SALARY GENDER   DEPT Unnamed: 6  Unnamed: 7
0     1    Geetha   19   10000      f    cse        anu      2002.0
1     2  laxmisri   20   20000      f    cse       2002      2002.0
2     3       sai   20   25000      m   mech       2002      2002.0
3     4   sumathi   18   30000      f  civil       2002      2002.0
4     5     satya   21   35000      f  civil       2002      2002.0
5     6    kalyan   22   40000      m    ece       2002      2002.0
6     7     madhu   19   25000      f  civil       2002      2002.0

In [64]:
import numpy as np
print(a.replace(to_replace="f",value=45))

   S NO      NAME  AGE  SALARY GENDER   DEPT Unnamed: 6  Unnamed: 7
0     1    Geetha   19   10000     45    cse        anu         NaN
1     2  laxmisri   20   20000     45    cse        NaN         NaN
2     3       sai   20   25000      m   mech        NaN         NaN
3     4   sumathi   18   30000     45  civil        NaN         NaN
4     5     satya   21   35000     45  civil        NaN         NaN
5     6    kalyan   22   40000      m    ece        NaN         NaN
6     7     madhu   19   25000     45  civil        NaN         NaN